---
kind: property
id: P:Autodesk.Revit.DB.LineProperties.Color
zh: 着色、上色、染色、填色
source: html/46bb969a-f734-11b0-326d-921efdbd8288.htm
---
# Autodesk.Revit.DB.LineProperties.Color Property

**中文**: 着色、上色、染色、填色

The current color used when drawing lines/curves.

## Syntax (C#)
```csharp
public Color Color { get; }
```